app/Controllers/Anggota.php

UPDATE `anggota` SET `nisn` = '1234', `alamat` = 'Tanjungsari', `no_hp` = '62345678990'
WHERE `id_anggota` = '2'
SELECT `a`.*, `u`.`nama`
FROM `anggota` `a`
LEFT JOIN `users` `u` ON `u`.`id` = `a`.`user_id`
---
    public function store()
    {
        $id_anggota = session()->get('id_anggota');

        $db = \Config\Database::connect();

        $db->table('anggota')
            ->where('id_anggota', $id_anggota)
            ->update([
                'nisn'   => $this->request->getPost('nisn'),
                'alamat' => $this->request->getPost('alamat'),
                'no_hp'  => $this->request->getPost('no_hp')
            ]);

        return redirect()->to('/peminjaman/create')
            ->with('success', 'Profil berhasil dilengkapi');