app/Controllers/Auth.php

    public function prosesLogin()
    {
        $session = session();
        $usersModel = new UsersModel();
        $anggotaModel = new \App\Models\AnggotaModel();
        $petugasModel = new \App\Models\PetugasModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $users = $usersModel->getUsersByUsername($username);

        if ($users) {
            if (password_verify($password, $users['password'])) {

                // ================= CEK ANGGOTA =================
                $idAnggota = null;
                $idPetugas = null;

                if ($users['role'] == 'anggota') {
                    $anggota = $anggotaModel
                        ->where('user_id', $users['id'])
                        ->first();

                    if ($anggota) {
                        $idAnggota = $anggota['id_anggota'];
                    }
                } else if ($users['role'] == 'petugas') {
                    $petugas = $petugasModel
                        ->where('user_id', $users['id'])
                        ->first();
---
SELECT *
FROM `petugas`
WHERE `user_id` = '7'
 LIMIT 1