app/Controllers/Buku.php

    public function index()
    {
        $keyword  = $this->request->getGet('keyword');
        $kategori = $this->request->getGet('kategori');

        $builder = $this->bukuModel
            ->select('buku.*, kategori.nama_kategori, penulis.nama_penulis, penerbit.nama_penerbit, rak.nama_rak, rak.lokasi')
            ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
            ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
            ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')
            ->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left')
            ->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left');

        if ($keyword) {
            $builder->groupStart()
                ->like('buku.judul', $keyword)
                ->orLike('buku.isbn', $keyword)
            ->groupEnd();
        }

        if ($kategori) {
            $builder->where('buku.id_kategori', $kategori);
        }

        $data = [
            'buku'     => $builder->paginate(10),
            'pager'    => $this->bukuModel->pager,
            'kategori' => (new KategoriModel())->findAll()
        ];
---
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`, `rak`.`lokasi`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
SELECT *
FROM `kategori`
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`, `rak`.`lokasi`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`
GROUP BY `buku`.`id_buku`

    public function create()
    {
        return view('buku/create', [
            'kategori' => (new KategoriModel())->findAll(),
            'penulis'  => (new PenulisModel())->findAll(),
            'penerbit' => (new PenerbitModel())->findAll(),
            'rak'      => (new RakModel())->findAll(),
        ]);
---
SELECT *
FROM `kategori`
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`

    public function wa($id)
    {
        $buku = $this->bukuModel
            ->select('buku.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
            ->find($id);

        if (!$buku) {
            return redirect()->back()->with('error', 'Buku tidak ditemukan');
---
SELECT *
FROM `kategori`