app/Controllers/Home.php

    public function stats()
    {
        $db = \Config\Database::connect();

        // TOTAL BUKU
        $total_buku = $db->table('buku')->countAllResults();

        // TOTAL ANGGOTA
        $total_anggota = $db->table('anggota')->countAllResults();

        // PEMINJAMAN AKTIF
        $peminjaman_aktif = $db->table('peminjaman')
            ->where('status', 'dipinjam')
            ->countAllResults();

        // TERLAMBAT (berdasarkan tanggal)
        $terlambat = $db->table('peminjaman')
            ->where('status', 'dipinjam')
            ->where('tanggal_kembali <', date('Y-m-d'))
            ->countAllResults();

        // PENGEMBALIAN
        $pengembalian = $db->table('pengembalian')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `anggota`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
AND `tanggal_kembali` < '2026-04-29'
SELECT COUNT(*) AS `numrows`
FROM `pengembalian`