app/Controllers/Kategori.php

   public function index()
{
    $keyword = $this->request->getGet('keyword');

    $kategoriModel = new \App\Models\KategoriModel();

    if ($keyword) {
        $kategori = $kategoriModel
            ->like('nama_kategori', $keyword)
            ->findAll();
    } else {
        $kategori = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`