app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `users`.`nama` as `nama_anggota`, GROUP_CONCAT(buku.judul SEPARATOR ", ") as daftar_buku
FROM `peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` ON `users`.`id` = `anggota`.`user_id`
LEFT JOIN `detail_peminjaman` ON `detail_peminjaman`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
LEFT JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
WHERE `peminjaman`.`id_anggota` = '7'
GROUP BY `peminjaman`.`id_peminjaman`
---
    public function index()
    {
        $builder = $this->db->table('peminjaman');

        $builder->select('
            peminjaman.*,
            users.nama as nama_anggota,
            GROUP_CONCAT(buku.judul SEPARATOR ", ") as daftar_buku
        ')
        ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left')
        ->join('users', 'users.id = anggota.user_id', 'left')
        ->join('detail_peminjaman', 'detail_peminjaman.id_peminjaman = peminjaman.id_peminjaman', 'left')
        ->join('buku', 'buku.id_buku = detail_peminjaman.id_buku', 'left')
        ->groupBy('peminjaman.id_peminjaman');

        if (session()->get('role') == 'anggota') {
            $builder->where('peminjaman.id_anggota', session()->get('id_anggota'));
        }

        $data['peminjaman'] = $builder->get()->getResultArray();