app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `users`.`nama` as `nama_anggota`, GROUP_CONCAT(buku.judul SEPARATOR ", ") as daftar_buku
FROM `peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` ON `users`.`id` = `anggota`.`user_id`
LEFT JOIN `detail_peminjaman` ON `detail_peminjaman`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
LEFT JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
GROUP BY `peminjaman`.`id_peminjaman`
ORDER BY `peminjaman`.`id_peminjaman` DESC
SELECT `peminjaman`.*, `users`.`nama` as `nama_anggota`, GROUP_CONCAT(buku.judul SEPARATOR ", ") as daftar_buku
FROM `peminjaman`
LEFT JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
LEFT JOIN `users` ON `users`.`id` = `anggota`.`user_id`
LEFT JOIN `detail_peminjaman` ON `detail_peminjaman`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
LEFT JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
WHERE `peminjaman`.`id_anggota` = '2'
GROUP BY `peminjaman`.`id_peminjaman`
ORDER BY `peminjaman`.`id_peminjaman` DESC
---
    public function index()
    {
        $builder = $this->db->table('peminjaman');

        $filter = $this->request->getGet('filter_pengantaran');

        $builder->select('
            peminjaman.*,
            users.nama as nama_anggota,
            GROUP_CONCAT(buku.judul SEPARATOR ", ") as daftar_buku
        ')
        ->join('anggota', 'anggota.id_anggota = peminjaman.id_anggota', 'left')
        ->join('users', 'users.id = anggota.user_id', 'left')
        ->join('detail_peminjaman', 'detail_peminjaman.id_peminjaman = peminjaman.id_peminjaman', 'left')
        ->join('buku', 'buku.id_buku = detail_peminjaman.id_buku', 'left');

        if (session()->get('role') == 'anggota') {
            $builder->where('peminjaman.id_anggota', session()->get('id_anggota'));

UPDATE `buku` SET `tersedia` = tersedia - 1
WHERE `id_buku` = '3'
---
                    'jumlah' => 1
                ]);

                $this->bukuModel->update($id_buku, [
                    'tersedia' => $dataBuku['tersedia'] - 1
                ]);

UPDATE `peminjaman` SET `status_pengantaran` = 'siap_diantar', `id_petugas` = NULL
WHERE `peminjaman`.`id_peminjaman` IN ('145')
---
    public function prosesBayar($id)
    {
        $file = $this->request->getFile('bukti');

        if (!$file || !$file->isValid()) {
            return redirect()->back()->with('error', 'File tidak valid');
        }

        $namaFile = $file->getRandomName();
        $file->move('uploads/bukti', $namaFile);

        $this->transaksiModel->insert([
            'id_peminjaman' => $id,
            'bukti' => $namaFile,
            'status' => 'menunggu_konfirmasi'
        ]);

        // 🔥 INI YANG BENAR (FIX UTAMA KAMU)
        $this->peminjamanModel->update($id, [
            'status' => 'menunggu_konfirmasi',
            'status_pengantaran' => 'menunggu_konfirmasi'
        ]);