app/Controllers/Penerbit.php

    public function index()
{
    $keyword = $this->request->getGet('keyword');

    $penerbitModel = new \App\Models\PenerbitModel();

    if ($keyword) {
        $penerbit = $penerbitModel
            ->like('nama_penerbit', $keyword)
            ->orLike('alamat', $keyword)
            ->findAll();
    } else {
        $penerbit = $penerbitModel->findAll();
---
SELECT *
FROM `penerbit`