app/Controllers/Pengembalian.php

public function bayar($id)
{
    $p = $this->db->table('pengembalian')
        ->select('pengembalian.*, denda.id_denda, denda.jumlah_denda')
        ->join('denda', 'denda.id_pengembalian = pengembalian.id_pengembalian', 'left')
        ->where('pengembalian.id_pengembalian', $id)
        ->get()
        ->getRowArray();
---
SELECT `pengembalian`.*, `denda`.`id_denda`, `denda`.`jumlah_denda`
FROM `pengembalian`
LEFT JOIN `denda` ON `denda`.`id_pengembalian` = `pengembalian`.`id_pengembalian`
WHERE `pengembalian`.`id_pengembalian` = '64'