app/Controllers/Users.php

    public function profile()
    {
        $id = session()->get('id');

        if (!$id) {
            return redirect()->to('/login');
        }

        $user = $this->users->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'

            );
        }

        $this->users->update($id, $data);
---
UPDATE `users` SET `nama` = 'Insaniar', `email` = 'ican7@gmail.com', `username` = 'ican', `role` = 'petugas', `foto` = '1775923007_15fc7f716253ab6d48c6.png'
WHERE `users`.`id` IN ('4')